--------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jadederong/Documents/CRG/wash-benefits/kenya/src/primary/analysis/icc.lo
> g
  log type:  text
 opened on:   2 Nov 2017, 08:48:00

. *********************************************
. * WASH Benefits Kenya
. * Primary outcome analysis 
. 
. * Estimate cluster-level ICCs for primary outcomes
. 
. * input: diarrhea.dta and endline-anthro.dta
. 
. * by Jade Benjamin-Chung (jadebc@berkeley.edu)
. *********************************************
. use "~/Dropbox/WASHB-Kenya-Data/1-primary-outcome-datasets/diarrhea.dta", clear

. keep if dcohort==1
(3,219 observations deleted)

. keep if time>0
(4,423 observations deleted)

. destring clusterid, replace
clusterid: all characters numeric; replaced as long

. loneway diarr7 clusterid

                   One-way Analysis of Variance for diarr7: 

                                             Number of obs =       12,628
                                                 R-squared =       0.0667

    Source                SS         df      MS            F     Prob > F
-------------------------------------------------------------------------
Between clusterid      165.48993    701    .23607693      1.22     0.0001
Within clusterid       2315.3869 11,926    .19414614
-------------------------------------------------------------------------
Total                  2480.8768 12,627    .19647397

         Intraclass       Asy.        
         correlation      S.E.       [95% Conf. Interval]
         ------------------------------------------------
            0.01187     0.00363       0.00474     0.01899

         Estimated SD of clusterid effect        .0482838
         Estimated SD within clusterid           .4406202
         Est. reliability of a clusterid mean     0.17761
              (evaluated at n=17.99)

. 
. 
. use "~/Dropbox/WASHB-Kenya-Data/1-primary-outcome-datasets/endline-anthro.dta", clear

. drop if haz==.
(439 observations deleted)

. keep if targetchild==1
(218 observations deleted)

. destring clusterid, replace
clusterid: all characters numeric; replaced as long

. loneway haz clusterid

      One-way Analysis of Variance for haz: Length/height-for-age Z-score

                                             Number of obs =        6,583
                                                 R-squared =       0.1395

    Source                SS         df      MS            F     Prob > F
-------------------------------------------------------------------------
Between clusterid      1084.7237    701    1.5473947      1.36     0.0000
Within clusterid       6689.8497  5,881    1.1375361
-------------------------------------------------------------------------
Total                  7774.5734  6,582    1.1811871

         Intraclass       Asy.        
         correlation      S.E.       [95% Conf. Interval]
         ------------------------------------------------
            0.03701     0.00763       0.02205     0.05196

         Estimated SD of clusterid effect        .2090781
         Estimated SD within clusterid           1.066553
         Est. reliability of a clusterid mean     0.26487
              (evaluated at n=9.38)

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/jadederong/Documents/CRG/wash-benefits/kenya/src/primary/analysis/icc.lo
> g
  log type:  text
 closed on:   2 Nov 2017, 08:48:00
--------------------------------------------------------------------------------------------
