-----------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jadederong/documents/crg/wash-benefits/Kenya/
> src/primary/dm/1_make_diarr_data.log
  log type:  text
 opened on:   6 Dec 2016, 13:10:16

. 
. *********************************************
. * WASH Benefits Kenya
. 
. * Make analysis dataset: diarrhea
. 
. * by Jade
. *********************************************
. clear all

. set more off

. cd "~/Dropbox/WASHB-Kenya-Data/0-Untouched-data/1-Main-survey/"
/Users/jadederong/Dropbox/WASHB-Kenya-Data/0-Untouched-data/1-Mai
> n-survey

. 
. 
. *********************************************
. * Prep compound-level variables
. *********************************************
. 
. use "1_Baseline/msP_bl_append_ID_clean_20161010.dta"

. tostring hhid clusterid, replace
hhid was long now str7
clusterid was double now str5

. 
. ren ms_bl_date date_baseline

. 
. gen month = month(date_baseline)

. 
. * imputing missing day of birth as first day of the month 
. replace b6_day=1 if b6_day==99 & b6_month!=99
(1,109 real changes made)

. replace b6_month=month(date_baseline) if b6_month==99 & b6_day!
> =99
(41 real changes made)

. 
. gen dm_miss = 1 if b6_day==99 & b6_month==99
(6,819 missing values generated)

. replace b6_day=day(date_baseline) if dm_miss == 1
(1,427 real changes made)

. replace b6_month=month(date_baseline) if dm_miss == 1
(1,427 real changes made)

. drop dm_miss

. 
. gen mother_dob = .
(8,246 missing values generated)

. replace mother_dob = mdy(b6_month, b6_day, b6_year)
(8,237 real changes made)

. replace mother_dob=. if b6_year==9999
(65 real changes made, 65 to missing)

. 
. format date_baseline mother_dob %d

. 
. gen mother_age = (date_baseline - mother_dob) / 365.25
(74 missing values generated)

. sum mother_age

    Variable |        Obs        Mean    Std. Dev.       Min     
>    Max
-------------+---------------------------------------------------
> ------
  mother_age |      8,172    25.90161    6.343542   14.48597   50
> .00137

. 
. gen mother_edu = 0 if b13_school==1 | b13_school==2
(3,926 missing values generated)

. replace mother_edu = 1 if b13_school==3
(1,859 real changes made)

. replace mother_edu = 2 if b13_school>=4 & b13_school<=8
(2,054 real changes made)

. replace mother_edu = 9 if mother_edu ==. 
(13 real changes made)

. label define mother_edul 0 "Incomplete primary" 1 "Complete pri
> mary" 2 "Any secondary" 9 "Dont know"

. label values mother_edu mother_edul 

. 
. * primary water source, regardless of whether it is for drinkin
> g
. replace d7_hrs=0 if d7_hrs==. & d7_min!=. 
(8,105 real changes made)

. gen water_time= (d7_hrs*60) + d7_min
(141 missing values generated)

. replace water_time=d7_hrs*60 if d7_hrs!=. & d7_min==.
(68 real changes made)

. sum water_time

    Variable |        Obs        Mean    Std. Dev.       Min     
>    Max
-------------+---------------------------------------------------
> ------
  water_time |      8,173    11.11257    15.47861          0     
>    600

. 
. gen roof=0

. replace roof=1 if b2_roof>=2
(5,456 real changes made)

. replace roof=9 if b2_roof==.
(6 real changes made)

. label define roofl 0 "Thatch/leaf" 1 "Iron/other" 9 "Missing/DK
> "

. label values roof roofl

. 
. gen walls=0

. replace walls=1 if b3_wall>=3
(389 real changes made)

. replace walls=9 if b3_wall==.
(6 real changes made)

. 
. replace walls=1 if b3_other=="BRICK"
(0 real changes made)

. replace walls=1 if b3_other=="BRICK AND MUD"
(0 real changes made)

. replace walls=1 if b3_other=="BRICK WITH SAND"
(0 real changes made)

. replace walls=1 if b3_other=="BRICKS"
(0 real changes made)

. replace walls=1 if b3_other=="BRICKS AND MUD"
(0 real changes made)

. replace walls=1 if b3_other=="BRICKS WITH MUD"
(0 real changes made)

. replace walls=1 if b3_other=="CEMENT ON MUD"
(0 real changes made)

. replace walls=1 if b3_other=="CONCRETE AND MUD"
(0 real changes made)

. replace walls=0 if b3_other=="MIXTURE OF STONES & MUD"
(1 real change made)

. replace walls=1 if b3_other=="MUD AND BAKED BRICKS"
(0 real changes made)

. replace walls=1 if b3_other=="MUD AND BRICKS"
(0 real changes made)

. replace walls=1 if b3_other=="MUD AND CONCRETE"
(0 real changes made)

. replace walls=0 if b3_other=="MUD AND STONE"
(1 real change made)

. replace walls=0 if b3_other=="MUD AND STONES"
(3 real changes made)

. replace walls=1 if b3_other=="MUD BUT CEMENTED"
(0 real changes made)

. replace walls=1 if b3_other=="MUD CEMENTED"
(0 real changes made)

. replace walls=1 if b3_other=="MUD PLASTERED WITH CEMENT"
(0 real changes made)

. replace walls=1 if b3_other=="MUD WITH ROUGH CAST"
(0 real changes made)

. replace walls=0 if b3_other=="STILL NO WALL"
(1 real change made)

. replace walls=0 if b3_other=="STONE WITH MUD"
(1 real change made)

. replace walls=1 if b3_other=="TILES"
(0 real changes made)

. 
. label define wallsl 0 "Bamboo/mud/cane" 1 "Concrete" 9 "Missing
> /DK"

. label values walls wallsl

. 
. gen floor = 0

. replace floor = 1 if b1_floor>=3
(492 real changes made)

. replace floor = 9 if b1_floor==.
(18 real changes made)

. label define floorl 0 "Earth/dung" 1 "Concrete" 9 "Missing/DK"

. label values floor floorl

. 
. gen elec=0

. replace elec=1 if b22a==1 
(562 real changes made)

. replace elec=9 if b22a==. 
(14 real changes made)

. label define elecl 0 "No electricity" 1 "Has electricity" 9 "Mi
> ssing/DK"

. label values elec elecl

. 
. gen radio=0

. replace radio=1 if b22b==1 
(5,730 real changes made)

. replace radio=9 if b22b==. 
(14 real changes made)

. label define radiol 0 "No radio" 1 "Has radio" 9 "Missing/DK"

. label values radio radiol

. 
. gen tv=0

. replace tv=1 if b22c==1 
(950 real changes made)

. replace tv=9 if b22c==. 
(14 real changes made)

. label define tvl 0 "No TV" 1 "Owns TV" 9 "Missing/DK"

. label values tv tvl

. 
. gen mobilephone=0

. replace mobilephone=1 if b22d==1
(6,522 real changes made)

. replace mobilephone=9 if b22d==.
(14 real changes made)

. label define mobilephonel 0 "No mobile phone" 1 "Any mobile pho
> nes" 9 "Missing/DK"

. label values mobilephone mobilephonel

. 
. gen clock=0

. replace clock=1 if b22e==1
(1,113 real changes made)

. replace clock=9 if b22e==.
(14 real changes made)

. label define clockl 0 "No clock" 1 "Has clock" 9 "Missing/DK"

. label values clock clockl

. 
. gen bicycle=0

. replace bicycle=1 if b22f==1
(4,218 real changes made)

. replace bicycle=9 if b22f==.
(14 real changes made)

. label define bicyclel 0 "No bicycle" 1 "Has bicycle" 9 "Missing
> /DK"

. label values bicycle bicyclel

. 
. gen motorcycle=0

. replace motorcycle=1 if b22g==1
(728 real changes made)

. replace motorcycle=9 if b22g==.
(14 real changes made)

. label define motorcyclel 0 "No motorcycle" 1 "Has motorcycle" 9
>  "Missing/DK"

. label values motorcycle motorcyclel

. 
. gen stove=0

. replace stove=1 if b22h==1
(4,070 real changes made)

. replace stove=9 if b22h==.
(14 real changes made)

. label define stovel 0 "No stove" 1 "Has stove" 9 "Missing/DK"

. label values stove stovel

. 
. gen cooker=0

. replace cooker=1 if b22i==1
(133 real changes made)

. replace cooker=9 if b22i==.
(14 real changes made)

. label define cookerl 0 "No gas cooker" 1 "Has gas cooker" 9 "Mi
> ssing/DK"

. label values cooker cookerl

. 
. gen car=0

. replace car=1 if b22j==1
(52 real changes made)

. replace car=9 if b22j==.
(14 real changes made)

. label define carl 0 "No car" 1 "Has car" 9 "Missing/DK"

. label values car carl

. 
. ren b24a_hh cow

. ren b24c_hh goat

. ren b24g_hh dog

. ren b24e_hh chicken 

. 
. foreach var of varlist cow goat dog chicken{
  2.         replace `var' = . if `var'==999
  3. }
(3 real changes made, 3 to missing)
(0 real changes made)
(2 real changes made, 2 to missing)
(78 real changes made, 78 to missing)

. 
. ren a6_gross Ncomp

. 
. gen u18=a4_4t18  + a5_0t3  
(6 missing values generated)

. replace u18 =. if u18==99
(2 real changes made, 2 to missing)

. 
. * food insecurity variable - based on Anne's SAS code
. replace c1907_fr = 0 if c1907==2
(6,860 real changes made)

. replace c1908_fr = 0 if c1908==2
(7,245 real changes made)

. replace c1909_fr = 0 if c1909==2
(7,642 real changes made)

. 
. gen hhs_7b=.
(8,246 missing values generated)

. gen hhs_8b=.
(8,246 missing values generated)

. gen hhs_9b=.
(8,246 missing values generated)

. 
. replace hhs_7b = 0 if c1907_fr == 0
(6,860 real changes made)

. replace hhs_7b = 1 if c1907_fr == 1
(814 real changes made)

. replace hhs_7b = 1 if c1907_fr == 2 
(390 real changes made)

. replace hhs_7b = 2 if c1907_fr == 3
(151 real changes made)

. replace hhs_8b = 0 if c1908_fr == 0
(7,245 real changes made)

. replace hhs_8b = 1 if c1908_fr == 1
(645 real changes made)

. replace hhs_8b = 1 if c1908_fr == 2 
(241 real changes made)

. replace hhs_8b = 2 if c1908_fr == 3 
(84 real changes made)

. replace hhs_9b = 0 if c1909_fr == 0 
(7,642 real changes made)

. replace hhs_9b = 1 if c1909_fr == 1 
(382 real changes made)

. replace hhs_9b = 1 if c1909_fr == 2
(140 real changes made)

. replace hhs_9b = 2 if c1909_fr == 3 
(51 real changes made)

. gen HHS_total = hhs_7b + hhs_8b + hhs_9b
(31 missing values generated)

. 
. gen HHS=.
(8,246 missing values generated)

. replace HHS=1 if HHS_total == 0
(6,621 real changes made)

. replace HHS=1 if HHS_total == 1
(686 real changes made)

. replace HHS=2 if HHS_total == 2
(420 real changes made)

. replace HHS=2 if HHS_total == 3 
(374 real changes made)

. replace HHS=3 if HHS_total == 4 
(61 real changes made)

. replace HHS=3 if HHS_total == 5
(26 real changes made)

. replace HHS=3 if HHS_total == 6 
(27 real changes made)

. 
. replace HHS=9 if HHS==.
(31 real changes made)

. 
. gen HHS_bi=.
(8,246 missing values generated)

. replace HHS_bi = 0 if HHS_total == 0 
(6,621 real changes made)

. replace HHS_bi = 0 if HHS_total == 1 
(686 real changes made)

. replace HHS_bi = 1 if HHS_total == 2 
(420 real changes made)

. replace HHS_bi = 1 if HHS_total == 3
(374 real changes made)

. replace HHS_bi = 1 if HHS_total == 4
(61 real changes made)

. replace HHS_bi = 1 if HHS_total == 5
(26 real changes made)

. replace HHS_bi = 1 if HHS_total == 6
(27 real changes made)

. 
. label variable HHS_total "Sum of hunger score responses"

. label variable HHS "Hunger score"

. label variable HHS_bi "Hunger dichotimized (little none (HHS=1)
>  vs. moderate(HHS=2) and severe (HHS=3)"

. 
. label define HHSl 1 "Little to none" 2 "Moderate" 3 "Severe" 9 
> "Missing"

. label values HHS HHSl 

. 
.         
. #delimit;
delimiter now ;
. keep hhid clusterid compoundid date_baseline date_baseline moth
> er_age mother_edu
> roof walls floor water_time roof walls floor elec radio tv mobi
> lephone clock
> bicycle motorcycle stove cooker car cow goat dog chicken Ncomp 
> u18 HHS;

. #delimit cr
delimiter now cr
. 
. 
. 
. * ---------------------------------------------
. * Save compound-level dataset
. * ---------------------------------------------
. tempfile compounddata

. save `compounddata'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_13583.00
> 0001 saved

. 
. 
. * ---------------------------------------------
. * Mother height
. * ---------------------------------------------
. * midline
. use "2_Midline/msP_ml_append_ID_clean_anthropometry_20160909.dt
> a", clear

. tostring hhid, replace
hhid was float now str7

. ren c422 c422m

. ren c423 c423m

. ren c424 c424m

. ren resp_hair resp_hairm

. ren resp_hair_height resp_hair_heightm

. keep c422m-c424m hhid resp_hair*

. * endline
. preserve

. use "3_Endline/msP_el_append_ID_clean_anthropometry_20160909.dt
> a", clear

. tostring hhid, replace
hhid was float now str7

. ren c422 c422e

. ren c423 c423e

. ren c424 c424e

. ren resp_hair resp_haire

. ren resp_hair_height resp_hair_heighte

. keep c422e-c424e hhid resp_hair*

. 
. tempfile endlinemomht

. save `endlinemomht'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_13583.00
> 0003 saved

. restore

. 
. merge 1:1 hhid using `endlinemomht'
(label resp_hair already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,457
        from master                       961  (_merge==1)
        from using                        496  (_merge==2)

    matched                             6,642  (_merge==3)
    -----------------------------------------

. drop _m

. 
. foreach var of varlist c422m-c424e{
  2.         sum `var'
  3. }

    Variable |        Obs        Mean    Std. Dev.       Min     
>    Max
-------------+---------------------------------------------------
> ------
       c422m |      5,913    160.2433    6.367442       52.3     
>  180.5

    Variable |        Obs        Mean    Std. Dev.       Min     
>    Max
-------------+---------------------------------------------------
> ------
       c423m |      5,913     160.241    6.371578       52.5     
>  180.4

    Variable |        Obs        Mean    Std. Dev.       Min     
>    Max
-------------+---------------------------------------------------
> ------
       c424m |      5,913    160.1946    6.860722       15.3     
>  185.9

    Variable |        Obs        Mean    Std. Dev.       Min     
>    Max
-------------+---------------------------------------------------
> ------
  resp_hairm |      4,284    1.129552    .3358489          1     
>      2

    Variable |        Obs        Mean    Std. Dev.       Min     
>    Max
-------------+---------------------------------------------------
> ------
resp_hair_~m |        555    2.029009    1.165883         .1     
>      6

    Variable |        Obs        Mean    Std. Dev.       Min     
>    Max
-------------+---------------------------------------------------
> ------
       c422e |        846    160.7898    6.156612      138.1     
>  177.6

    Variable |        Obs        Mean    Std. Dev.       Min     
>    Max
-------------+---------------------------------------------------
> ------
       c423e |        846     160.779    6.154872      138.1     
>  177.5

    Variable |        Obs        Mean    Std. Dev.       Min     
>    Max
-------------+---------------------------------------------------
> ------
       c424e |        846    160.7944    6.160126      138.1     
>  177.6

. 
. replace c422m = c422m - resp_hair_heightm if resp_hairm==2
(555 real changes made)

. replace c423m = c423m - resp_hair_heightm if resp_hairm==2
(555 real changes made)

. replace c424m = c424m - resp_hair_heightm if resp_hairm==2
(555 real changes made)

. 
. replace c422e = c422e - resp_hair_heighte if resp_haire==2
(61 real changes made)

. replace c423e = c423e - resp_hair_heighte if resp_haire==2
(61 real changes made)

. replace c424e = c424e - resp_hair_heighte if resp_haire==2
(61 real changes made)

. 
. egen float med_momht_6 = rowmedian(c422m c423m c424m c422e c423
> e c424e)
(1348 missing values generated)

. egen float med_momht_m = rowmedian(c422m c423m c424m)
(2186 missing values generated)

. egen float med_momht_e = rowmedian(c422e c423e c424e)
(7253 missing values generated)

. 
. gen float motherht = med_momht_6
(1,348 missing values generated)

. replace motherht = med_momht_m if abs(med_momht_m - med_momht_e
> ) > 3 & abs(med_momht_m - med_momht_e)<.
(1 real change made)

. 
. keep hhid motherht

. 
. tempfile motherht

. save `motherht'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_13583.00
> 0004 saved

. 
. 
. 
. *********************************************
. * Prep baseline child-level variables
. *********************************************
. 
. * ---------------------------------------------
. * Child diarrhea
. * --------------------------------------------- 
. use "1_Baseline/msP_bl_child_diarr_20161010.dta", clear

. tostring childid hhid, replace
childid was long now str9
hhid was long now str7

. 
. * At baseline, some children had diarrhea recorded twice
. * Using the first measurement
. tab threedefa_*, mis

 Did [NAME] |
 have three |
    or more |
 defecation |
  events in |
twenty-four |
      hours |
today? YOU  |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |        414        7.57        7.57
         NO |      4,973       90.90       98.46
 DON'T KNOW |         31        0.57       99.03
          . |         53        0.97      100.00
------------+-----------------------------------
      Total |      5,471      100.00

. tab softa_*, mis

 Did [NAME] |
have watery |
    or soft |
      stool |
 (unformed) |
 today? YOU |
 CAN SELECT |
 Don t Know |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |      1,290       23.58       23.58
         NO |      4,084       74.65       98.23
 DON'T KNOW |         44        0.80       99.03
          . |         53        0.97      100.00
------------+-----------------------------------
      Total |      5,471      100.00

. tab blooda_*, mis

 Did [NAME] |
 have blood |
   in their |
      stool |
 today? YOU |
 CAN SELECT |
 Don t Know |
 BY GOING T |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |         40        0.73        0.73
         NO |      5,340       97.61       98.34
 DON'T KNOW |         38        0.69       99.03
          . |         53        0.97      100.00
------------+-----------------------------------
      Total |      5,471      100.00

. tab threedefd_*, mis

 Did [NAME] |
 have three |
    or more |
 defecation |
  events in |
   the last |
 seven days |
  (since th |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |      1,385       25.32       25.32
         NO |      3,996       73.04       98.35
 DON'T KNOW |         37        0.68       99.03
          . |         53        0.97      100.00
------------+-----------------------------------
      Total |      5,471      100.00

. tab softd_*, mis

 Did [NAME] |
have watery |
    or soft |
      stool |
 (unformed) |
in the last |
 seven days |
  (since th |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |      1,667       30.47       30.47
         NO |      3,724       68.07       98.54
 DON'T KNOW |         27        0.49       99.03
          . |         53        0.97      100.00
------------+-----------------------------------
      Total |      5,471      100.00

. tab bloodd_*, mis

 Did [NAME] |
 have blood |
   in their |
   stool in |
   the last |
 seven days |
(since this |
   day last |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |        116        2.12        2.12
         NO |      5,279       96.49       98.61
 DON'T KNOW |         23        0.42       99.03
          . |         53        0.97      100.00
------------+-----------------------------------
      Total |      5,471      100.00

. 
. foreach var of varlist threedefa_1 threedefb_1 threedefc_1 thre
> edefd_1 softa_1 softb_1 softc_1 softd blooda_1 bloodb_1 bloodc_
> 1 bloodd_1{
  2.         replace `var' = . if `var'==9
  3.         replace `var' = . if `var'==99
  4.         tab `var'
  5. }
(31 real changes made, 31 to missing)
(0 real changes made)

 Did [NAME] |
 have three |
    or more |
 defecation |
  events in |
twenty-four |
      hours |
today? YOU  |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |        414        7.69        7.69
         NO |      4,973       92.31      100.00
------------+-----------------------------------
      Total |      5,387      100.00
(56 real changes made, 56 to missing)
(0 real changes made)

 Did [NAME] |
 have three |
    or more |
 defecation |
  events in |
twenty-four |
      hours |
yesterday?  |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |      1,038       19.36       19.36
         NO |      4,324       80.64      100.00
------------+-----------------------------------
      Total |      5,362      100.00
(67 real changes made, 67 to missing)
(0 real changes made)

 Did [NAME] |
 have three |
    or more |
 defecation |
  events in |
twenty-four |
  hours the |
    day bef |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |        982       18.35       18.35
         NO |      4,369       81.65      100.00
------------+-----------------------------------
      Total |      5,351      100.00
(37 real changes made, 37 to missing)
(0 real changes made)

 Did [NAME] |
 have three |
    or more |
 defecation |
  events in |
   the last |
 seven days |
  (since th |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |      1,385       25.74       25.74
         NO |      3,996       74.26      100.00
------------+-----------------------------------
      Total |      5,381      100.00
(44 real changes made, 44 to missing)
(0 real changes made)

 Did [NAME] |
have watery |
    or soft |
      stool |
 (unformed) |
 today? YOU |
 CAN SELECT |
 Don t Know |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |      1,290       24.00       24.00
         NO |      4,084       76.00      100.00
------------+-----------------------------------
      Total |      5,374      100.00
(44 real changes made, 44 to missing)
(0 real changes made)

 Did [NAME] |
have watery |
    or soft |
      stool |
 (unformed) |
 yesterday? |
    YOU CAN |
 SELECT Don |
         t  |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |      1,348       25.08       25.08
         NO |      4,026       74.92      100.00
------------+-----------------------------------
      Total |      5,374      100.00
(40 real changes made, 40 to missing)
(0 real changes made)

 Did [NAME] |
have watery |
    or soft |
      stool |
 (unformed) |
    the day |
     before |
 yesterday? |
     YOU CA |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |      1,334       24.80       24.80
         NO |      4,044       75.20      100.00
------------+-----------------------------------
      Total |      5,378      100.00
(27 real changes made, 27 to missing)
(0 real changes made)

 Did [NAME] |
have watery |
    or soft |
      stool |
 (unformed) |
in the last |
 seven days |
  (since th |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |      1,667       30.92       30.92
         NO |      3,724       69.08      100.00
------------+-----------------------------------
      Total |      5,391      100.00
(38 real changes made, 38 to missing)
(0 real changes made)

 Did [NAME] |
 have blood |
   in their |
      stool |
 today? YOU |
 CAN SELECT |
 Don t Know |
 BY GOING T |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |         40        0.74        0.74
         NO |      5,340       99.26      100.00
------------+-----------------------------------
      Total |      5,380      100.00
(32 real changes made, 32 to missing)
(0 real changes made)

 Did [NAME] |
 have blood |
   in their |
      stool |
 yesterday? |
    YOU CAN |
 SELECT Don |
  t Know BY |
        GOI |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |         45        0.84        0.84
         NO |      5,341       99.16      100.00
------------+-----------------------------------
      Total |      5,386      100.00
(26 real changes made, 26 to missing)
(0 real changes made)

 Did [NAME] |
 have blood |
   in their |
  stool the |
 day before |
 yesterday? |
    YOU CAN |
  SELECT Do |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |         63        1.17        1.17
         NO |      5,329       98.83      100.00
------------+-----------------------------------
      Total |      5,392      100.00
(23 real changes made, 23 to missing)
(0 real changes made)

 Did [NAME] |
 have blood |
   in their |
   stool in |
   the last |
 seven days |
(since this |
   day last |      Freq.     Percent        Cum.
------------+-----------------------------------
        YES |        116        2.15        2.15
         NO |      5,279       97.85      100.00
------------+-----------------------------------
      Total |      5,395      100.00

. 
. * WHO diarrhea definition: 3+ loose or watery stools in 24 hour
> s 
. * OR one or more stools with blood
. 
. * 3+ stools in last 2 days
. gen plus3stool=0

. replace plus3stool=1 if threedefa_1 ==1 | threedefb_1==1 | thre
> edefc_1==1
(1,283 real changes made)

. replace plus3stool=. if threedefa_1 ==. & threedefb_1==. & thre
> edefc_1==.
(73 real changes made, 73 to missing)

. 
. * water stool in last 2 days
. gen watery=0

. replace watery=1 if softa_1==1 | softb_1==1 | softc_1==1
(1,599 real changes made)

. replace watery=. if softa_1==. & softb_1==. & softc_1==.
(77 real changes made, 77 to missing)

. 
. * blood stool in last 2 days
. gen bloody=0

. replace bloody=1 if blooda_1==1 | bloodb_1==1 | bloodc_1==1
(97 real changes made)

. replace bloody=. if blooda_1==. & bloodb_1==. & bloodc_1==.
(75 real changes made, 75 to missing)

. 
. * 2-day diarrhea
. gen diarr2 = 0

. replace diarr2 = 1 if (plus3stool==1 & watery==1) | bloody==1
(734 real changes made)

. replace diarr2 = . if (plus3stool==. | watery==.) & bloody!=1
(79 real changes made, 79 to missing)

. replace diarr2 = . if (plus3stool!=1 & watery!=1) & bloody==.
(1 real change made, 1 to missing)

. replace diarr2 = . if plus3stool==. & watery==. & bloody==. 
(0 real changes made)

. 
. codebook diarr2

-----------------------------------------------------------------
diarr2                                                (unlabeled)
-----------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  80/
> 5,471

            tabulation:  Freq.  Value
                         4,657  0
                           734  1
                            80  .

. 
. * 7-day diarrhea
. gen diarr7 = 0

. replace diarr7 = 1 if diarr2==1 | ((threedefd_1==1 & softd_1==1
> ) | bloodd_1==1)
(820 real changes made)

. replace diarr7 = . if ((threedefd_1==. | softd_1==.) & bloodd_1
> !=1)
(97 real changes made, 97 to missing)

. replace diarr7 = . if ((threedefd_1!=1 | softd_1!=1) & bloodd_1
> ==.)
(2 real changes made, 2 to missing)

. replace diarr7 = . if (threedefd_1==. & softd_1==. & bloodd_1==
> .)
(0 real changes made)

. replace diarr7 = 1 if diarr2==1
(0 real changes made)

. 
. codebook diarr7

-----------------------------------------------------------------
diarr7                                                (unlabeled)
-----------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  99/
> 5,471

            tabulation:  Freq.  Value
                         4,552  0
                           820  1
                            99  .

. 
. keep hhid childid diarr2 diarr7 staffid

. 
. *---------------------------------------------
. * mother height
. *---------------------------------------------
. 
. merge m:1 hhid using `motherht'

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,567
        from master                        86  (_merge==1)
        from using                      3,481  (_merge==2)

    matched                             5,385  (_merge==3)
    -----------------------------------------

. 
. * drop heights that don't correspond to <36 child information 
. drop if _m==2
(3,481 observations deleted)

. drop _m

. 
. gen time =0

. 
. tempfile baseline

. save `baseline'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_13583.00
> 0005 saved

. 
. *********************************************
. * Prep midline child-level variables
. *********************************************
. 
. * ---------------------------------------------
. * Child diarrhea
. * ---------------------------------------------
. use "2_Midline/msP_ml_child_diarr_20161010.dta", clear

. tostring hhid childid, replace
hhid was double now str7
childid was double now str10

. 
. foreach var of varlist threedefa threedefb threedefc threedefd 
> softa softb softc softd blooda bloodb bloodc bloodd{
  2.         replace `var' = . if `var'==9
  3.         replace `var' = . if `var'==99
  4.         tab `var'
  5. }
(0 real changes made)
(24 real changes made, 24 to missing)

   Three or |
       more |
 defecation |
     events |
      Today |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        495        7.13        7.13
         No |      6,449       92.87      100.00
------------+-----------------------------------
      Total |      6,944      100.00
(0 real changes made)
(64 real changes made, 64 to missing)

   Three or |
       more |
 defecation |
     events |
  Yesterday |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,969       28.52       28.52
         No |      4,935       71.48      100.00
------------+-----------------------------------
      Total |      6,904      100.00
(0 real changes made)
(97 real changes made, 97 to missing)

   Three or |
       more |
 defecation |
 events Day |
     before |
  Yesterday |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,132       31.03       31.03
         No |      4,739       68.97      100.00
------------+-----------------------------------
      Total |      6,871      100.00
(0 real changes made)
(25 real changes made, 25 to missing)

Did  have 3 |
    OR MORE |
 DEFECATION |
  EVENTS in |
   24hrs in |
 the last 7 |
      days? |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,872       41.37       41.37
         No |      4,071       58.63      100.00
------------+-----------------------------------
      Total |      6,943      100.00
(0 real changes made)
(56 real changes made, 56 to missing)

  Watery or |
 soft stool |
 (unformed) |
      Today |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,330       33.71       33.71
         No |      4,582       66.29      100.00
------------+-----------------------------------
      Total |      6,912      100.00
(0 real changes made)
(46 real changes made, 46 to missing)

  Watery or |
 soft stool |
 (unformed) |
  Yesterday |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,506       36.20       36.20
         No |      4,416       63.80      100.00
------------+-----------------------------------
      Total |      6,922      100.00
(0 real changes made)
(43 real changes made, 43 to missing)

  Watery or |
 soft stool |
 (unformed) |
 Day before |
  Yesterday |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,529       36.52       36.52
         No |      4,396       63.48      100.00
------------+-----------------------------------
      Total |      6,925      100.00
(0 real changes made)
(24 real changes made, 24 to missing)

  Did  have |
  WATERY OR |
       SOFT |
 (UNFORMED) |
STOOLin the |
     last 7 |
days? (sinc |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      3,272       47.12       47.12
         No |      3,672       52.88      100.00
------------+-----------------------------------
      Total |      6,944      100.00
(0 real changes made)
(37 real changes made, 37 to missing)

   Blood in |
Stool Today |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         86        1.24        1.24
         No |      6,845       98.76      100.00
------------+-----------------------------------
      Total |      6,931      100.00
(0 real changes made)
(34 real changes made, 34 to missing)

   Blood in |
      Stool |
  Yesterday |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        107        1.54        1.54
         No |      6,827       98.46      100.00
------------+-----------------------------------
      Total |      6,934      100.00
(0 real changes made)
(32 real changes made, 32 to missing)

   Blood in |
  Stool Day |
     before |
  Yesterday |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        123        1.77        1.77
         No |      6,813       98.23      100.00
------------+-----------------------------------
      Total |      6,936      100.00
(0 real changes made)
(22 real changes made, 22 to missing)

  Did  have |
   BLOOD IN |
  THE STOOL |
in the last |
    7 days? |
(since this |
      day l |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        213        3.07        3.07
         No |      6,733       96.93      100.00
------------+-----------------------------------
      Total |      6,946      100.00

. 
. * WHO diarrhea definition: 3+ loose or watery stools in 24 hour
> s 
. * OR one or more stools with blood
. 
. * 3+ stools in last 2 days
. gen plus3stool=0

. replace plus3stool=1 if threedefa ==1 | threedefb==1 | threedef
> c==1
(2,679 real changes made)

. replace plus3stool=. if threedefa ==. & threedefb==. & threedef
> c==.
(73 real changes made, 73 to missing)

. 
. * water stool in last 2 days
. gen watery=0

. replace watery=1 if softa==1 | softb==1 | softc==1
(3,079 real changes made)

. replace watery=. if softa==. & softb==. & softc==.
(85 real changes made, 85 to missing)

. 
. * blood stool in last 2 days
. gen bloody=0

. replace bloody=1 if blooda==1 | bloodb==1 | bloodc==1
(168 real changes made)

. replace bloody=. if blooda==. & bloodb==. & bloodc==.
(81 real changes made, 81 to missing)

. 
. * 2-day diarrhea
. gen diarr2 = 0

. replace diarr2 = 1 if (plus3stool==1 & watery==1) | bloody==1
(1,706 real changes made)

. replace diarr2 = . if (plus3stool==. | watery==.) & bloody!=1
(90 real changes made, 90 to missing)

. replace diarr2 = . if (plus3stool!=1 & watery!=1) & bloody==.
(2 real changes made, 2 to missing)

. replace diarr2 = . if plus3stool==. & watery==. & bloody==. 
(0 real changes made)

. 
. codebook diarr2

-----------------------------------------------------------------
diarr2                                                (unlabeled)
-----------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  92/
> 7,029

            tabulation:  Freq.  Value
                         5,231  0
                         1,706  1
                            92  .

. 
. * 7-day diarrhea
. gen diarr7 = 0

. replace diarr7 = 1 if diarr2==1 | ((threedefd==1 & softd==1) | 
> bloodd==1)
(1,912 real changes made)

. replace diarr7 = . if ((threedefd==. | softd==.) & bloodd!=1)
(98 real changes made, 98 to missing)

. replace diarr7 = . if ((threedefd!=1 | softd!=1) & bloodd==.)
(2 real changes made, 2 to missing)

. replace diarr7 = . if (threedefd==. & softd==. & bloodd==.)
(0 real changes made)

. replace diarr7 = 1 if diarr2==1
(0 real changes made)

. 
. 
. codebook diarr7

-----------------------------------------------------------------
diarr7                                                (unlabeled)
-----------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  100
> /7,029

            tabulation:  Freq.  Value
                         5,017  0
                         1,912  1
                           100  .

. 
. keep hhid childid diarr2 diarr7 staffid

. 
. 
. *---------------------------------------------
. * mother height
. *---------------------------------------------
. 
. merge m:1 hhid using `motherht'

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,000
        from master                         8  (_merge==1)
        from using                      1,992  (_merge==2)

    matched                             7,021  (_merge==3)
    -----------------------------------------

. 
. * drop heights that don't correspond to <36 child information 
. drop if _m==2
(1,992 observations deleted)

. drop _m

. 
. gen time=1

. 
. 
. tempfile midline

. save `midline'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_13583.00
> 0006 saved

. 
. 
. *********************************************
. * Prep endline child-level variables
. *********************************************
. 
. * ---------------------------------------------
. * Child diarrhea
. * ---------------------------------------------
. use "3_Endline/msP_el_child_diarr_20161010.dta", clear

. tostring childid hhid, replace
childid was double now str10
hhid was double now str7

. 
. foreach var of varlist threedefa_ad threedefb_ad threedefc_ad t
> hreedefd_ad softa_ad softb_ad softc_ad softd_ad blooda_ad blood
> b_ad bloodc_ad bloodd_ad{
  2.         replace `var' = . if `var'==9
  3.         replace `var' = . if `var'==99
  4.         tab `var'
  5. }
(0 real changes made)
(11 real changes made, 11 to missing)

     TODAY? |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        445        6.29        6.29
         No |      6,630       93.71      100.00
------------+-----------------------------------
      Total |      7,075      100.00
(0 real changes made)
(57 real changes made, 57 to missing)

 YESTERDAY? |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,172       30.90       30.90
         No |      4,857       69.10      100.00
------------+-----------------------------------
      Total |      7,029      100.00
(0 real changes made)
(82 real changes made, 82 to missing)

 DAY BEFORE |
 YESTERDAY? |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,391       34.14       34.14
         No |      4,613       65.86      100.00
------------+-----------------------------------
      Total |      7,004      100.00
(0 real changes made)
(30 real changes made, 30 to missing)

Did  have 3 |
    OR MORE |
 DEFECATION |
  EVENTS in |
   24hrs in |
 the last 7 |
      days? |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      3,227       45.73       45.73
         No |      3,829       54.27      100.00
------------+-----------------------------------
      Total |      7,056      100.00
(0 real changes made)
(10 real changes made, 10 to missing)

     TODAY? |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,177       30.77       30.77
         No |      4,899       69.23      100.00
------------+-----------------------------------
      Total |      7,076      100.00
(0 real changes made)
(34 real changes made, 34 to missing)

 YESTERDAY? |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,309       32.74       32.74
         No |      4,743       67.26      100.00
------------+-----------------------------------
      Total |      7,052      100.00
(0 real changes made)
(36 real changes made, 36 to missing)

 DAY BEFORE |
 YESTERDAY? |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,365       33.55       33.55
         No |      4,685       66.45      100.00
------------+-----------------------------------
      Total |      7,050      100.00
(0 real changes made)
(24 real changes made, 24 to missing)

  Did  have |
  WATERY OR |
       SOFT |
 (UNFORMED) |
STOOLin the |
     last 7 |
days? (sinc |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      3,097       43.85       43.85
         No |      3,965       56.15      100.00
------------+-----------------------------------
      Total |      7,062      100.00
(0 real changes made)
(11 real changes made, 11 to missing)

     TODAY? |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         59        0.83        0.83
         No |      7,016       99.17      100.00
------------+-----------------------------------
      Total |      7,075      100.00
(0 real changes made)
(24 real changes made, 24 to missing)

 YESTERDAY? |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         71        1.01        1.01
         No |      6,991       98.99      100.00
------------+-----------------------------------
      Total |      7,062      100.00
(0 real changes made)
(24 real changes made, 24 to missing)

 DAY BEFORE |
 YESTERDAY? |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        112        1.59        1.59
         No |      6,950       98.41      100.00
------------+-----------------------------------
      Total |      7,062      100.00
(0 real changes made)
(21 real changes made, 21 to missing)

  Did  have |
   BLOOD IN |
  THE STOOL |
in the last |
    7 days? |
(since this |
      day l |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        236        3.34        3.34
         No |      6,829       96.66      100.00
------------+-----------------------------------
      Total |      7,065      100.00

. 
. * At endline diarrhea was measured at the anthro day and 
. * at the uptake measurement.
. * Using the anthro day measure 
. 
. * WHO diarrhea definition: 3+ loose or watery stools in 24 hour
> s 
. * OR one or more stools with blood
. 
. * 3+ stools in last 2 days
. gen plus3stool=0

. replace plus3stool=1 if threedefa_ad ==1 | threedefb_ad==1 | th
> reedefc_ad==1
(2,873 real changes made)

. replace plus3stool=. if threedefa_ad ==. & threedefb_ad==. & th
> reedefc_ad==.
(697 real changes made, 697 to missing)

. 
. * water stool in last 2 days
. gen watery=0

. replace watery=1 if softa_ad==1 | softb_ad==1 | softc_ad==1
(2,804 real changes made)

. replace watery=. if softa_ad==. & softb_ad==. & softc_ad==.
(697 real changes made, 697 to missing)

. 
. * blood stool in last 2 days
. gen bloody=0

. replace bloody=1 if blooda_ad==1 | bloodb_ad==1 | bloodc_ad==1
(174 real changes made)

. replace bloody=. if blooda_ad==. & bloodb_ad==. & bloodc_ad==.
(698 real changes made, 698 to missing)

. 
. 
. * 2-day diarrhea
. gen diarr2 = 0

. replace diarr2 = 1 if (plus3stool==1 & watery==1) | bloody==1
(1,492 real changes made)

. replace diarr2 = . if (plus3stool==. | watery==.) & bloody!=1
(699 real changes made, 699 to missing)

. replace diarr2 = . if (plus3stool!=1 & watery!=1) & bloody==.
(2 real changes made, 2 to missing)

. replace diarr2 = . if plus3stool==. & watery==. & bloody==. 
(0 real changes made)

. 
. codebook diarr2

-----------------------------------------------------------------
diarr2                                                (unlabeled)
-----------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  701
> /7,778

            tabulation:  Freq.  Value
                         5,585  0
                         1,492  1
                           701  .

. 
. * 7-day diarrhea
. gen diarr7 = 0

. replace diarr7 = 1 if diarr2==1 | ((threedefd_ad==1 & softd_ad=
> =1) | bloodd_ad==1)
(1,850 real changes made)

. replace diarr7 = . if ((threedefd_ad==. | softd_ad==.) & bloodd
> _ad!=1)
(731 real changes made, 731 to missing)

. replace diarr7 = . if ((threedefd_ad!=1 | softd_ad!=1) & bloodd
> _ad==.)
(4 real changes made, 4 to missing)

. replace diarr7 = . if (threedefd_ad==. & softd_ad==. & bloodd_a
> d==.)
(0 real changes made)

. replace diarr7 = 1 if diarr2==1
(0 real changes made)

. 
. keep hhid childid diarr2 diarr7 staffid

. 
. * ---------------------------------------------
. * Mother's height
. * ---------------------------------------------
. merge m:1 hhid using `motherht'

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,475
        from master                         1  (_merge==1)
        from using                      1,474  (_merge==2)

    matched                             7,777  (_merge==3)
    -----------------------------------------

. 
. * drop heights that don't correspond to <36 child information 
. drop if _m==2
(1,474 observations deleted)

. drop _m

. 
. gen time =2

. 
. tempfile endline

. save `endline'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_13583.00
> 0007 saved

. 
. *********************************************
. * Combine individual-level variables from all 3 time points
. *********************************************
. use `baseline', clear

. append using `midline'
(note: variable childid was str9, now str10 to accommodate
       using data's values)

. append using `endline'

. 
. tempfile childdata

. save `childdata'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_13583.00
> 0008 saved

. 
. * ---------------------------------------------
. * Child age and sex
. * ---------------------------------------------
. preserve

. use "msP_child_IDchar_20161103.dta", clear

. tostring childid hhid, replace
childid was double now str10
hhid was double now str7

. 
. * indicators for child type
. gen sibling = (childtype>2)

. gen targetchild= (childtype<=2)

. gen newbirth = (childtype==6)

. 
. * rename date vars
. ren ms_bl_date date_base

. ren ms_ml_ad_date date_mid

. ren ms_el_ad_date date_end

. 
. * calculate age
. ren DOB dob

. 
. recode sex (1=0) (2=1) 
(sex: 12693 changes made)

. label define sexl 0 "Male" 1 "Female"

. label values sex sexl

. 
. keep hhid childid date* sibling targetchild newbirth date* dob 
> sex

. 
. tempfile agesex

. save `agesex'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_13583.00
> 000a saved

. restore

. 
. merge m:1 childid using `agesex'

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,019
        from master                         0  (_merge==1)
        from using                      1,019  (_merge==2)

    matched                            20,278  (_merge==3)
    -----------------------------------------

. drop _m

. 
. * survey date
. gen date = .
(21,297 missing values generated)

. replace date=date_base if time==0
(5,471 real changes made)

. replace date=date_mid if time==1
(7,029 real changes made)

. replace date=date_end if time==2
(7,770 real changes made)

. 
. format date* %d

. drop date_*

. 
. drop if diarr2==. & diarr7==. & date==.
(1,027 observations deleted)

. 
. gen month=month(date)

. 
. * create age at each time point
. gen double aged=(date-dob)
(182 missing values generated)

. gen double agem=(date-dob)/30.4167
(182 missing values generated)

. gen double agey=(date-dob)/365.25
(182 missing values generated)

. 
. gen dcohort=0

. replace dcohort=1 if agey<3 & targetchild==0 & diarr7!=. & time
> ==0
(4,423 real changes made)

. replace dcohort=1 if targetchild==1 & diarr7!=. & time==1
(6,134 real changes made)

. replace dcohort=1 if targetchild==1 & diarr7!=. & time==2
(6,494 real changes made)

. replace dcohort=0 if agem==.
(0 real changes made)

. 
. *********************************************
. * Merge endline individual- and compound-level variables
. *********************************************
. merge m:1 hhid using `compounddata'

    Result                           # of obs.
    -----------------------------------------
    not matched                           542
        from master                         0  (_merge==1)
        from using                        542  (_merge==2)

    matched                            20,270  (_merge==3)
    -----------------------------------------

. 
. * drop if no child info for that compound
. drop if _m==2
(542 observations deleted)

. drop _m

. 
. * ---------------------------------------------
. * merge in block
. * ---------------------------------------------
. merge m:1 clusterid using "~/Dropbox/WASHB-Kenya-Data/0-Untouch
> ed-data/0-Treatment-assignments/washb-kenya-tr.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            20,270  (_merge==3)
    -----------------------------------------

. 
. * drop if there are no children in that compound
. * no data for clusterid 11027
. drop if _m==2
(0 observations deleted)

. drop _m

. 
. sort hhid childid time

. order block clusterid compoundid hhid childid time targetchild 
> tr date 

. 
. outsheet using "~/Dropbox/WASHB-Kenya-Data/1-primary-outcome-da
> tasets/diarrhea.csv", replace comma 

. save  "~/Dropbox/WASHB-Kenya-Data/1-primary-outcome-datasets/di
> arrhea.dta", replace 
file ~/Dropbox/WASHB-Kenya-Data/1-primary-outcome-datasets/diarrh
> ea.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/jadederong/documents/crg/wash-benefits/Kenya/
> src/primary/dm/1_make_diarr_data.log
  log type:  text
 closed on:   6 Dec 2016, 13:10:19
-----------------------------------------------------------------
